In [1]:
import mysql.connector
from mysql.connector import Error

In [2]:
try: 
    connection = mysql.connector.connect(host='35.208.82.175', 
                                         database='dbgsipp7ucsuwy',
                                         user='uqsnolewgvge8',
                                         password='upgradehub', connection_timeout=180)

    if connection.is_connected():
        db_Info = connection.get_server_info()
        print("Connected to MySQL database... MySQL Server version on ", db_Info)

        cursor = connection.cursor()
        connection.commit()

except Error as e:
    print("Error while connecting to MySQL", e)
finally:
    # closing database connection.
    if connection.is_connected():
        cursor.close()
        connection.close()
        print("MySQL connection is closed")

Connected to MySQL database... MySQL Server version on  5.7.39-42-log
MySQL connection is closed

#### Empezamos a conectarnos y extraer informacion

In [45]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)

#### Saber tablas

In [5]:
import pandas as pd

In [7]:
pd.read_sql("SHOW TABLES", con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\3696277070.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql("SHOW TABLES", con = connection)

  Tables_in_dbgsipp7ucsuwy
0                 EMPLEADO
1                   PEDIDO
2      PEDIDOS_FINALIZADOS
3                 PRODUCTO
4        RANKING_PRODUCTOS
5               REPARTIDOR
6                   consta
7           esta_compuesto
8                    users

In [4]:
cursor=connection.cursor()
query1 = """ SELECT * FROM PRODUCTO; """  
cursor.execute(query1)
cursor.fetchall()

[('01', 'Hamburguesa', 2.6),
 ('02', 'Patatas', 2.0),
 ('03', 'tomate', 0.5),
 ('04', 'Queso', 1.0),
 ('05', 'Lechuga', 0.5),
 ('06', 'Pollo', 3.6),
 ('08', 'Bacon', 1.5),
 ('09', 'Coca cola', 3.0),
 ('10', 'Nestea', 3.0),
 ('11', 'Menú de Pollo', 5.0),
 ('12', 'Menú de Hamburguesa con queso', 6.0),
 ('13', 'Menú de Pollo con queso', 6.0),
 ('14', 'Menú de Hamburguesa', 6.0),
 ('15', 'Helado', 1.0),
 ('16', 'Tarta', 2.0),
 ('17', 'Fruta', 1.0),
 ('18', 'Agua', 2.0),
 ('19', 'Fanta', 3.0)]

In [10]:
df = pd.read_sql(query1, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\1798547775.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query1, con = connection)

In [11]:
df

   Codigo                         Nombre  Precio
0      01                    Hamburguesa     2.6
1      02                        Patatas     2.0
2      03                         tomate     0.5
3      04                          Queso     1.0
4      05                        Lechuga     0.5
5      06                          Pollo     3.6
6      08                          Bacon     1.5
7      09                      Coca cola     3.0
8      10                         Nestea     3.0
9      11                  Menú de Pollo     5.0
10     12  Menú de Hamburguesa con queso     6.0
11     13        Menú de Pollo con queso     6.0
12     14            Menú de Hamburguesa     6.0
13     15                         Helado     1.0
14     16                          Tarta     2.0
15     17                          Fruta     1.0
16     18                           Agua     2.0
17     19                          Fanta     3.0

#### Obtener el número de pedido, dni del repartidor y hora de reparto de aquellos pedidos que se toman nota después de las siete de la tarde

In [17]:
cursor=connection.cursor()
query2 = """ SELECT Numero, DNI_R, Hora_rep FROM PEDIDO WHERE Hora_tm >'19:00' and Hora_rep
is not null; """  
cursor.execute(query2)
cursor.fetchall()

df2 = pd.read_sql(query2, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\3396938883.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df2 = pd.read_sql(query2, con = connection)

In [18]:
df2

  Numero      DNI_R        Hora_rep
0   0005  14188151T 0 days 19:45:00
1   0006  04477744T 0 days 21:45:00
2   0007  14188151T 0 days 23:35:00

#### Obtener todos los campos de empleados que cobran entre 900 y 1000 euros.

In [22]:
cursor=connection.cursor()
query3 = """ SELECT * FROM EMPLEADO WHERE Salario BETWEEN 900 AND 1000; """  
cursor.execute(query3)
cursor.fetchall()

df3 = pd.read_sql(query3, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\328761688.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df3 = pd.read_sql(query3, con = connection)

In [23]:
df3

         DNI                 Nombre          Nss   Turno  Salario
0  04444444T   Úrsula Delta Camacho  11177788899  mañana    900.0
1  11111111Q     Luis Ramírez Pardo  23445556666  mañana    900.0
2  14111155T   Sergio Lérida Campos  55577700089   tarde   1000.0
3  22222222S      María Sánchez Cid  11112223334   tarde   1000.0
4  33333333M  Martín Guerrero López  33344455566   tarde   1000.0
5  55555555J   Carmen Hernández Pío  99966633311  mañana    900.0
6  77777777M     Pedro Jiménez Ruiz  23456785432   tarde   1000.0
7  99999999X      Raúl Rodrigo Roca  55566677789   tarde   1000.0

#### Obtener el número de pedido e importe de aquellos que han sido registrados en el mes de noviembre de 2020 y su importe es mayor a 15 Euros.

In [25]:
cursor=connection.cursor()
query4 = """ SELECT Numero, importe FROM PEDIDO WHERE fecha BETWEEN '2020-11-01' AND
'2020-11-30' AND importe >'15'; """  
cursor.execute(query4)
cursor.fetchall()

df4 = pd.read_sql(query4, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\313591196.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df4 = pd.read_sql(query4, con = connection)

In [26]:
df4

  Numero  importe
0   0006     23.0
1   0009     25.0
2   0010     45.0
3   0011     45.0

#### Obtener por cada uno de los repartidores su DNI junto a la cantidad de pedidos entregados.

In [29]:
cursor=connection.cursor()
query5 = """ SELECT DNI_R, COUNT(*) FROM PEDIDO WHERE DNI_R is not null GROUP BY DNI_R; """  
cursor.execute(query5)
cursor.fetchall()

df5 = pd.read_sql(query5, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\2199674767.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df5 = pd.read_sql(query5, con = connection)

In [30]:
df5

       DNI_R  COUNT(*)
0  04477744T         2
1  11245621Q         1
2  14188151T         2
3  55675675J         1
4  99009900J         3

#### Obtener por cada mes (con el formato de nombre y no de número ej. Noviembre),la cantidad de pedidos realizados

In [33]:
cursor=connection.cursor()
query6 = """ SELECT MONTHNAME(Fecha) AS mes, COUNT(*) AS 'Pedidos realizados' FROM PEDIDO GROUP BY mes ORDER BY MIN(Fecha); """  
cursor.execute(query6)
cursor.fetchall()

df6 = pd.read_sql(query6, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\3387034638.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df6 = pd.read_sql(query6, con = connection)

In [34]:
df6

         mes  Pedidos realizados
0  September                   3
1    October                   2
2   November                   6

#### Obtener un listado con el nombre y dni de los empleados en el mismo campo y anteponiendo el dni al nombre de la siguiente forma (ej; 45776633P, Juan Rodríguez López) que tenga turno de “tarde” o "noche". Ordenar el listado por dni.

In [41]:
cursor=connection.cursor()
query7 = """ SELECT CONCAT(DNI,', ',Nombre) AS Lista, Turno FROM EMPLEADO WHERE Turno IN ('tarde','noche') ORDER BY DNI; """  
cursor.execute(query7)
cursor.fetchall()

df7 = pd.read_sql(query7, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\3479579628.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df7 = pd.read_sql(query7, con = connection)

In [38]:
df7

                                 Lista  Turno
0    03232323P, María Luisa Galdón Ter  noche
1      14111155T, Sergio Lérida Campos  tarde
2  14567555L, Piedad Colmenero Zapillo  noche
3         22222222S, María Sánchez Cid  tarde
4     33333333M, Martín Guerrero López  tarde
5        77777777M, Pedro Jiménez Ruiz  tarde
6   88888888O, Soledad Campillo Molina  noche
7         99999999X, Raúl Rodrigo Roca  tarde

#### Obtener el nombre, código y precio de aquellos productos que superen o igualen la media de todos los precios. Ordenar de mayor a menor precio.

In [43]:
cursor=connection.cursor()
query8 = """ SELECT Nombre,Codigo, Precio FROM PRODUCTO WHERE Precio >= (SELECT AVG(Precio) FROM PRODUCTO) ORDER BY precio DESC; """  
cursor.execute(query8)
cursor.fetchall()

df8 = pd.read_sql(query8, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\1070289444.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df8 = pd.read_sql(query8, con = connection)

In [44]:
df8

                          Nombre Codigo  Precio
0  Menú de Hamburguesa con queso     12     6.0
1        Menú de Pollo con queso     13     6.0
2            Menú de Hamburguesa     14     6.0
3                  Menú de Pollo     11     5.0
4                          Pollo     06     3.6
5                      Coca cola     09     3.0
6                         Nestea     10     3.0
7                          Fanta     19     3.0

#### Obtener un listado con el nombre y DNI de los empleados que no han preparado nunca ningún pedido.

In [50]:
cursor=connection.cursor()
query9 = """ SELECT DISTINCT nombre, DNI FROM EMPLEADO LEFT JOIN PEDIDO ON EMPLEADO.dni = PEDIDO.dni_ep WHERE PEDIDO.dni_ep IS NULL; """
cursor.execute(query9)
cursor.fetchall()

df9 = pd.read_sql(query9, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\3282190995.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df9 = pd.read_sql(query9, con = connection)

In [51]:
df9

                 nombre        DNI
0    Luis Ramírez Pardo  11111111Q
1  Sergio Lérida Campos  14111155T
2     Raúl Rodrigo Roca  99999999X

#### Acerco la celda del código por comodidad

In [78]:
connection = mysql.connector.connect(host='35.208.82.175', database='dbgsipp7ucsuwy', user='uqsnolewgvge8', password='upgradehub', connection_timeout=1800)

#### Obtener el código, nombre y precio de los productos(estos dos últimos en el mismo campo) que están contenidos en los pedidos que ha tomado nota "Luis" o "María Luisa". Ordena el listado de mayor a menor valor por fecha del pedido

In [58]:
cursor=connection.cursor()
query10 = """ SELECT PR.Codigo, CONCAT(PR.Nombre, ' ' , PR.Precio) AS NOMBRE_PRECIO FROM PRODUCTO PR, PEDIDO P, consta C, EMPLEADO E
WHERE PR.Codigo = C.Codigo_Pr AND P.Numero= C.Numero_P AND P.DNI_ETM= E.DNI AND E.nombre LIKE '%Luis%'  ORDER BY P.Fecha DESC """
cursor.execute(query10)
cursor.fetchall()

df10 = pd.read_sql(query10, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\1053379119.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df10 = pd.read_sql(query10, con = connection)

In [59]:
df10

  Codigo                       NOMBRE_PRECIO
0     12  Menú de Hamburguesa con queso 6.00
1     11                  Menú de Pollo 5.00
2     12  Menú de Hamburguesa con queso 6.00
3     09                      Coca cola 3.00
4     02                        Patatas 2.00

#### Obtener por cada repartidor, su nombre, cantidad de pedidos y el tiempo medio que tardan en entregar los pedidos una vez preparados. Ordenar el listado el tiempo medio que tardan en entregarlos:

In [70]:
cursor=connection.cursor()
query11 = """ SELECT R.Nombre, COUNT(*) AS Numero_repartos, TIME_FORMAT(AVG(TIMEDIFF(Hora_rep,Hora_pre)), '%T') AS tiempo_medio FROM REPARTIDOR R, PEDIDO P 
WHERE R.DNI = P.DNI_R GROUP BY R.DNI ORDER BY 3; """
cursor.execute(query11)
cursor.fetchall()

df11 = pd.read_sql(query11, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\261048044.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df11 = pd.read_sql(query11, con = connection)

In [71]:
df11

                  Nombre  Numero_repartos tiempo_medio
0  Laura Jiménez Jiménez                2     00:12:50
1       Juan Pardo Rubio                1     00:15:00
2    Carlos Sánchez Ruíz                2     00:19:00
3  Alejandro Pardo López                3     00:25:00
4     Juan Sánchez López                1     00:30:00

#### Obtener un listado obteniendo el código, nombre y el precio de los productos cuyo precios sea el más barato o el más caro de todos

In [64]:
cursor=connection.cursor()
query12 = """ SELECT Codigo, Nombre, Precio FROM PRODUCTO WHERE Precio = (SELECT MAX(precio) FROM PRODUCTO)
OR precio = (SELECT MIN(precio) FROM PRODUCTO); """
cursor.execute(query12)
cursor.fetchall()

df12 = pd.read_sql(query12, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\297499568.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df12 = pd.read_sql(query12, con = connection)

In [65]:
df12

  Codigo                         Nombre  Precio
0     03                         tomate     0.5
1     05                        Lechuga     0.5
2     12  Menú de Hamburguesa con queso     6.0
3     13        Menú de Pollo con queso     6.0
4     14            Menú de Hamburguesa     6.0

#### Obtener por cada producto , el nombre y código el número total de pedidos en los que se encuentra teniendo en cuenta que el total de pedidos en los cuales se encuentre sea superior o igual a dos. Ordena el listado de mayor a menor número de productos.

In [73]:
cursor=connection.cursor()
query13 = """SELECT PR.Nombre, PR.Codigo, COUNT(P.Numero) AS Total_pedidos FROM PEDIDO P, PRODUCTO PR, consta C
WHERE P.Numero = C.numero_P AND PR.Codigo = C.Codigo_PR GROUP BY PR.Codigo HAVING Total_pedidos >=2 
ORDER BY Total_pedidos DESC;"""
cursor.execute(query13)
cursor.fetchall()

df13 = pd.read_sql(query13, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\4037520776.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df13 = pd.read_sql(query13, con = connection)

In [74]:
df13

                          Nombre Codigo  Total_pedidos
0        Menú de Pollo con queso     13              6
1  Menú de Hamburguesa con queso     12              6
2                  Menú de Pollo     11              3
3                          Queso     04              3
4                         Helado     15              2
5                        Patatas     02              2

#### Mostrar listado de los empleados (código y NSS en la misma columna) que han tomado nota de algún pedido y contienen el producto de código 13 y además el repartidor sea 'Laura'.

In [76]:
cursor=connection.cursor()
query14 = """SELECT E.nombre, CONCAT(E.DNI, ' ' , E.Nss) AS Identificacion FROM EMPLEADO E, PEDIDO P, REPARTIDOR R, consta C
WHERE E.DNI = P.DNI_ETM AND R.DNI = P.DNI_R AND P.numero = C.numero_P AND R.nombre LIKE '%Laura%' AND C.codigo_Pr ='13';"""
cursor.execute(query14)
cursor.fetchall()

df14 = pd.read_sql(query14, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\1352356573.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df14 = pd.read_sql(query14, con = connection)

In [77]:
df14

                     nombre         Identificacion
0         Raúl Rodrigo Roca  99999999X 55566677789
1  Piedad Colmenero Zapillo  14567555L 23456734534

#### Obtener el nombre del producto que es menú junto con el código de los productos que lo componen en aquellos pedidos del mes de septiembre de 2020.

In [79]:
cursor=connection.cursor()
query15 = """SELECT P.numero AS numero_pedido, PR.nombre, PR.codigo, EC.codigo_P_compuesto AS producto_que_lo_compone,
PRODUCTO.nombre AS descipcion_p_que_lo_compone FROM PRODUCTO PR, PEDIDO P, esta_compuesto EC, consta C, PRODUCTO PRODUCTO
WHERE PR.codigo=EC.codigo_p AND PR.codigo=C.codigo_PR AND P.numero=C.numero_P AND PRODUCTO.codigo= EC.codigo_p_compuesto
AND P.fecha BETWEEN '2020-09-01' AND '2020-09-30';"""
cursor.execute(query15)
cursor.fetchall()

df15 = pd.read_sql(query15, con = connection)

C:\Users\asus\AppData\Local\Temp\ipykernel_3108\2640141647.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df15 = pd.read_sql(query15, con = connection)

In [80]:
df15

,numero_pedido,nombre,codigo,producto_que_lo_compone,descipcion_p_que_lo_compone
0,0005,Menú de Hamburguesa con queso,12,01,Hamburguesa
1,0005,Menú de Hamburguesa con queso,12,02,Patatas
2,0005,Menú de Hamburguesa con queso,12,04,Queso
3,0005,Menú de Hamburguesa con queso,12,10,Nestea
4,0005,Menú de Hamburguesa con queso,12,16,Tarta
5,0005,Menú de Pollo con queso,13,02,Patatas
6,0005,Menú de Pollo con queso,13,04,Queso
7,0005,Menú de Pollo con queso,13,06,Pollo
8,0005,Menú de Pollo con queso,13,08,Bacon
9,0005,Menú de Pollo con queso,13,09,Coca cola
10,0005,Menú de Pollo con queso,13,15,Helado
11,0007,Menú de Hamburguesa con queso,12,01,Hamburguesa
12,0007,Menú de Hamburguesa con queso,12,02,Patatas
13,0007,Menú de Hamburguesa con queso,12,04,Queso
14,0007,Menú de Hamburguesa con queso,12,10,Nestea
15,0007,Menú de Hamburguesa con queso,12,16,Tarta
16,0008,Menú de Pollo,11,02,Patatas
17,0008,Menú de Pollo,11,03,tomate
18,0008,Menú de Pollo,11,06,Pollo
19,0008,Menú de Pollo,11,17,Fruta
20,0008,Menú de Pollo,11,18,Agua
21,0008,Menú de Pollo con queso,13,02,Patatas
22,0008,Menú de Pollo con queso,13,04,Queso
23,0008,Menú de Pollo con queso,13,06,Pollo
24,0008,Menú de Pollo con queso,13,08,Bacon
25,0008,Menú de Pollo con queso,13,09,Coca cola
26,0008,Menú de Pollo con queso,13,15,Helado